name = input("Привет! Введи своё имя. ")
print(f"""{name}, мы начинаем игру.
Тебе будут заданы 10 вопросов. Каждый вопрос имеет 4 варианта ответа, но только один правильный. Как только ты дашь неправильный ответ, игра закончится.
Но есть и приятные бонусы - несгораемые суммы.
После 3 вопроса твой несгораемый выигрыш составит 300000.
После 7 вопроса он увеличится до 700000.
Если же ты ответишь на все вопросы правильно, ты получишь 1000000!!! Желаю удачи!""")
score = 0
questions = [
"""Вот твой первый вопрос:
Кто был первым президентом России?
1. Путин
2. Ельцин
3. Медведев
4. Мишустин
Ответ впишите в виде цифры: """,
"""Второй вопрос:
Кто основатель компании Microsoft?
1. Гейтс
2. Джобс
3. Маск
4. Цукерберг
Ответ впишите в виде цифры: """,
"""Третий вопрос:
Как назывался особый головной убор, который носили фараоны в Древнем Египте?
1. Картуз
2. Немес
3. Корона
4. Убрус
Ответ запишите в виде цифры: """,
"""Четвёртый вопрос:
Что растёт в огороде?
1. Лук
2. Пистолет
3. Пулемёт
4. Пакета CC-20
Ответ запишите в виде цифры: """,
"""Пятый вопрос:
Как называют микроавтобусы, совершающие поездки по определённым маршрутам?
1. Рейсовка
2. Путёвка
3. Курсовка
4. Маршрутка
Ответ запишите в виде цифры: """,
"""Шестой вопрос:
О чём писал Грибоедов, отмечая, что он «нам сладок и приятен»?
1. Дым Отечества
2. Дух купечества
3. Дар пророчества
4. Пыл девичества
Ответ запишите в виде цифры: """,
"""Седьмой вопрос:
Какой персонаж отсутствует в известной считалке «На золотом крыльце сидели»?
1. Сапожник
2. Кузнец
3. Царь
4. Портной
Ответ запишите в виде цифры: """,
"""Восьмой вопрос:
Какой специалист изучает неопознанные летающие объекты?
1. Кинолог
2. Уфолог
3. Сексолог
4. Психиатр
Ответ запишите в виде цифры: """,
"""Девятый вопрос:
Как называется разновидность воды, в которой атом водорода замещён его изотопом дейтерием?
1. Лёгкая
2. Средняя
3. Тяжёлая
4. Невесомая
Ответ запишите в виде цифры: """,
"""Десятый вопрос:
Что такое десница?
1. Бровь
2. Глаз
3. Шея
4. Рука
Ответ запишите в виде цифры: """
]
player_answers = []
true_answers = [2, 1, 2, 1, 4, 1, 2, 2, 3, 4]
for number, question in enumerate(questions):
    print(question)
    answer = int(input())
    player_answers.append(answer)
    if true_answers[number] == player_answers[number]:
        score += 1
    else:
        print(f"Вы ошиблись на вопросе {number + 1}")
        break
if score <3:
    print("Сожалеем, но вы ничего не выиграли.")
elif score >=3 and score <7:
    print("Поздравляем, вы выиграли 300k.")
elif score >=7 and score <10:
    print("Поздравляем, вы выиграли 700k.")
elif score == 10:
    print("Поздравляем, вы выиграли 1kk!!!")